* alper


|                  |   a |   b |  c |      d | row-total |
|------------------+-----+-----+----+--------+-----------|
| check-sum        |   4 |   5 |  7 |   1000 |      1016 |
|------------------+-----+-----+----+--------+-----------|
| <2023-01-26 Thu> |  10 |   2 |  2 |      1 |        15 |
|                  |   3 |   4 |  5 |      6 |        18 |
|------------------+-----+-----+----+--------+-----------|
| calculated-sum   | (9) | (1) | ok | (-993) |           |
|------------------+-----+-----+----+--------+-----------|
#+TBLFM: @>$<<..$>>='(let ((sum (apply '+ '(@II..@-1))) (expected @2)) (if (= sum expected) "ok" (format "(%s)" (- sum expected))));N::@2$>..@4$>=vsum($2..$5)
